import numpy as np


# 遵循, 从自己手里出去, 取负, 从银行到手, 为正

# 终值 = np.fv(利率,期数, 每期支付, 现值)
# 将1000元以1%的年利率存入银行5年, 每年加存100元, 到期后本息合计多少钱?
fv = np.fv(0.01, 5, -100, -1000)
print("存钱到期后本金和", round(fv, 2))


# 现值 = np.pv(0.01, 5, -100, fv)
# 将多少钱以1%的年利率存入银行5年, 每年加存100元, 到期后本息合计fv元?
pv = np.pv(0.01, 5, -100, fv)
print("以本金和(终值)倒推现值", round(pv, 2))


# 净现值 = np.npv(利率, 现金流)
# 将1000元以1%的年利率存入银行5年, 每年加存100元, 相当于一次存入多少?
npv = np.npv(0.01, [-1000, -100, -100, -100, -100, -100])
print("分期存达到的和一次存达到的目标相同时", round(npv, 2))


# 内部收益率 = np.irr(现金流)
# 将1000元存入银行5年, 以后逐年提现100元, 200元, 300元, 400元, 500元, 
# 银行的年利率达到多少可在最后一次提现后偿清全部本息, 这就叫内部收益率, 即净现值为0元
irr = np.irr((-1000, 100, 200, 300, 400, 500))
print("内部收益率为", round(irr, 2))
npv = np.npv(irr, (-1000, 100, 200, 300, 400, 500))
print("与该内部收益相关的净现值", round(npv, 2))

print("==============贷款==============")

# 每期支付 = np.pmt(利率, 期数, 现值)
# 以1%的年利率从银行贷款1000元, 分5年还清, 平均每年还多少钱?
pmt = np.pmt(0.01, 5, 1000)
print("银行还款金额", round(pmt, 2))


# 还款期数 = np.nper(利率, 每期支付, 现值)
# 以1%的年利率从银行贷款1000, 平均每年还款pmt元, 多少年还清?
nper = np.nper(0.01, pmt, 1000)
print("偿还期数", nper)


# 利率 = np.rate(期数, 每期支付, 现值, 终值)
# 从银行贷款1000元, 平均每年还pmt元, nper年还清, 年利率多少?
rate = np.rate(nper, pmt, 1000, 0)
print("贷款利率", round(rate, 2))
